//  ---------------------------------------------------------------------------------------------------------------  //
//  de.Request
//  ---------------------------------------------------------------------------------------------------------------  //

var url_ = require('url');

//  ---------------------------------------------------------------------------------------------------------------  //

var de = require('./de.js');

require('./de.common.js');

//  ---------------------------------------------------------------------------------------------------------------  //

de.Request = function(request) {
    //  FIXME: Зачем запоминать ссылку на оригинальный request?
    /// this._request = request;
    this.headers = request.headers;
    this.cookies = de.parseCookies(this.headers.cookie || '');

    var url = url_.parse(request.url, true, true);

    this.query = url.query;
    this.path = url.pathname;
};

//  ---------------------------------------------------------------------------------------------------------------  //

