//  ---------------------------------------------------------------------------------------------------------------  //
//  de.Request
//  ---------------------------------------------------------------------------------------------------------------  //

var url_ = require('url');

//  ---------------------------------------------------------------------------------------------------------------  //

var no = require('nommon');
var de = require('./de.js');

require('./de.common.js');

//  ---------------------------------------------------------------------------------------------------------------  //

var http_ = require('http');

//  ---------------------------------------------------------------------------------------------------------------  //

/**
    @param {http_.IncomingMessage} request  Входящий http-реквест.
    @param {Object=} extra_params  Дополнительные параметры, например, из post-запроса.
*/
de.Request = function(request, extra_params) {
    this.headers = request.headers;
    this.cookies = de.parseCookies(this.headers.cookie || '');

    this.url = url_.parse(request.url, true, true);
    if (extra_params) {
        no.extend(this.url.query, extra_params);
    }

    this.method = request.method;
};

//  ---------------------------------------------------------------------------------------------------------------  //

